STMicroelectronics/STM32CubeH7/Projects/STM32H750B-DK/Demonstrations/MenuLauncher/Gui/Target/LCDConf.c
/**
  ******************************************************************************
  * @file    lcdconf.c
  * @author  MCD Application Team
  * @version V1.2.0
  * @date    30-December-2016
  * @brief   This file implements the configuration for the GUI library
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "LCDConf.h"
#include "GUI_Private.h"
#include "GUIDRV_Lin.h"

#include "stm32h7xx_hal.h"
#include "cmsis_os.h"

extern void Error_Handler(void);

/** @addtogroup LCD CONFIGURATION
* @{
*/

/** @defgroup LCD CONFIGURATION
* @brief This file contains the LCD Configuration
* @{
*/

/** @defgroup LCD CONFIGURATION_Private_TypesDefinitions
* @{
*/
/**
* @}
*/

/** @defgroup LCD CONFIGURATION_Private_Defines
* @{
*/
#define XSIZE_PHYS      480
#define YSIZE_PHYS      272

#define NUM_BUFFERS      3 /* Number of multiple buffers to be used */
#define NUM_VSCREENS     1 /* Number of virtual screens to be used */

#define BK_COLOR GUI_DARKBLUE

#undef  GUI_NUM_LAYERS
#define GUI_NUM_LAYERS        1

#ifndef FB_BYTES_PER_PIXEL
#define FB_BYTES_PER_PIXEL    4                       /* 4 - 3 - 2 */
#endif /* FB_BYTES_PER_PIXEL */

// #define DMA2D_ALPHA_BLENDING

#if (FB_BYTES_PER_PIXEL == 2)
#define COLOR_CONVERSION_0    GUICC_M565              /* GUICC_M8888I - GUICC_M888 - GUICC_M565 */
#define DISPLAY_DRIVER_0      GUIDRV_LIN_16           /* GUIDRV_LIN_32 - GUIDRV_LIN_24 - GUIDRV_LIN_16 */
#if (GUI_NUM_LAYERS > 1)
#define COLOR_CONVERSION_1    GUICC_M4444I            /* GUICC_M8888I - GUICC_M1555I - GUICC_M4444I */
#define DISPLAY_DRIVER_1      GUIDRV_LIN_16           /* GUIDRV_LIN_32 - GUIDRV_LIN_24 - GUIDRV_LIN_16 */
#endif

#elif (FB_BYTES_PER_PIXEL == 3)
#define COLOR_CONVERSION_0    GUICC_M888              /* GUICC_M8888I - GUICC_M888 - GUICC_M565 */
#define DISPLAY_DRIVER_0      GUIDRV_LIN_24           /* GUIDRV_LIN_32 - GUIDRV_LIN_24 - GUIDRV_LIN_16 */
#if (GUI_NUM_LAYERS > 1)
#define COLOR_CONVERSION_1    GUICC_M1555I             /* GUICC_M8888I - GUICC_M1555I - GUICC_M4444I */
#define DISPLAY_DRIVER_1      GUIDRV_LIN_24           /* GUIDRV_LIN_32 - GUIDRV_LIN_24 - GUIDRV_LIN_16 */
#endif

#elif (FB_BYTES_PER_PIXEL == 4)
#define COLOR_CONVERSION_0    GUICC_M8888I            /* GUICC_M8888I - GUICC_M888 - GUICC_M565 */
#define DISPLAY_DRIVER_0      GUIDRV_LIN_32           /* GUIDRV_LIN_32 - GUIDRV_LIN_24 - GUIDRV_LIN_16 */
#if (GUI_NUM_LAYERS > 1)
#define COLOR_CONVERSION_1    GUICC_M8888I            /* GUICC_M8888I - GUICC_M1555I - GUICC_M4444I */
#define DISPLAY_DRIVER_1      GUIDRV_LIN_32           /* GUIDRV_LIN_32 - GUIDRV_LIN_24 - GUIDRV_LIN_16 */
#endif /* GUI_NUM_LAYERS */

#else
#error Please set a correct value for FB_BYTES_PER_PIXEL !!
#endif /* FB_BYTES_PER_PIXEL */

#ifndef   XSIZE_PHYS
#error Physical X size of display is not defined!
#endif
#ifndef   YSIZE_PHYS
#error Physical Y size of display is not defined!
#endif
#ifndef   NUM_VSCREENS
#define NUM_VSCREENS 1
#else
#if (NUM_VSCREENS <= 0)
#error At least one screeen needs to be defined!
#endif
#endif
#if (NUM_VSCREENS > 1) && (NUM_BUFFERS > 1)
#error Virtual screens and multiple buffers are not allowed!
#endif

#define FRAMEBUFFER_SIZE  (XSIZE_PHYS * YSIZE_PHYS * FB_BYTES_PER_PIXEL)

#if defined ( __GNUC__ )
__attribute__((section(".framebuffer"))) __attribute__ ((aligned (32)))
#elif defined ( __ICCARM__ )
#pragma data_alignment=32
#pragma location="framebuffer"
#elif defined( __CC_ARM )
__attribute__((section(".framebuffer"), zero_init)) __attribute__ ((aligned (32)))
#endif
static U8 layer0_fb0[FRAMEBUFFER_SIZE];

#if (NUM_BUFFERS > 1)
#if defined ( __GNUC__ )
__attribute__((section(".framebuffer"))) __attribute__ ((aligned (32)))
#elif defined ( __ICCARM__ )
#pragma data_alignment=32
#pragma location="framebuffer"
#elif defined( __CC_ARM )
__attribute__((section(".framebuffer"), zero_init)) __attribute__ ((aligned (32)))
#endif
static U8 layer0_fb1[FRAMEBUFFER_SIZE];
#endif

#if (NUM_BUFFERS > 2)
#if defined ( __GNUC__ )
__attribute__((section(".framebuffer"))) __attribute__ ((aligned (32)))
#elif defined ( __ICCARM__ )
#pragma data_alignment=32
#pragma location="framebuffer"
#elif defined( __CC_ARM )
__attribute__((section(".framebuffer"), zero_init)) __attribute__ ((aligned (32)))
#endif
static U8 layer0_fb2[FRAMEBUFFER_SIZE];
#endif

#if GUI_NUM_LAYERS > 1

#if defined ( __GNUC__ )
__attribute__((section(".framebuffer"))) __attribute__ ((aligned (32)))
#elif defined ( __ICCARM__ )
#pragma data_alignment=32
#pragma location="framebuffer"
#elif defined( __CC_ARM )
__attribute__((section(".framebuffer"), zero_init)) __attribute__ ((aligned (32)))
#endif
static U8 layer1_fb0[FRAMEBUFFER_SIZE];

#if (NUM_BUFFERS > 1)
#if defined ( __GNUC__ )
__attribute__((section(".framebuffer"))) __attribute__ ((aligned (32)))
#elif defined ( __ICCARM__ )
#pragma data_alignment=32
#pragma location="framebuffer"
#elif defined( __CC_ARM )
__attribute__((section(".framebuffer"), zero_init)) __attribute__ ((aligned (32)))
#endif
static U8 layer1_fb1[FRAMEBUFFER_SIZE];
#endif

#if (NUM_BUFFERS > 2)
#if defined ( __GNUC__ )
__attribute__((section(".framebuffer"))) __attribute__ ((aligned (32)))
#elif defined ( __ICCARM__ )
#pragma data_alignment=32
#pragma location="framebuffer"
#elif defined( __CC_ARM )
__attribute__((section(".framebuffer"), zero_init)) __attribute__ ((aligned (32)))
#endif
static U8 layer1_fb2[FRAMEBUFFER_SIZE];
#endif

#endif /* GUI_NUM_LAYERS */

static U8 const *Framebuffers[GUI_NUM_LAYERS][NUM_BUFFERS] =
{
  {
    layer0_fb0
#if (NUM_BUFFERS > 1)
  , layer0_fb1
#endif
#if (NUM_BUFFERS > 2)
  , layer0_fb2
#endif
  }
#if (GUI_NUM_LAYERS > 1)
, {
    layer1_fb0
#if (NUM_BUFFERS > 1)
  , layer1_fb1
#endif
#if (NUM_BUFFERS > 2)
  , layer1_fb2
#endif
  }
#endif /* GUI_NUM_LAYERS */
};

/**
* @}
*/

/* Redirect bulk conversion to DMA2D routines */
#define DEFINE_DMA2D_COLORCONVERSION(PFIX, PIXELFORMAT)                                                        \
static void _Color2IndexBulk_##PFIX##_DMA2D(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex) { \
  _DMA_Color2IndexBulk(pColor, pIndex, NumItems, SizeOfIndex, PIXELFORMAT);                                    \
}                                                                                                              \
static void _Index2ColorBulk_##PFIX##_DMA2D(void * pIndex, LCD_COLOR * pColor, U32 NumItems, U8 SizeOfIndex) { \
  _DMA_Index2ColorBulk(pIndex, pColor, NumItems, SizeOfIndex, PIXELFORMAT);                                    \
}

/**
  * @}
  */
/** @defgroup LCD CONFIGURATION_Private_Variables
  * @{
  */
DMA2D_HandleTypeDef                  hdma2d;
LTDC_HandleTypeDef                   hltdc;
static LCD_LayerPropTypedef          layer_prop[GUI_NUM_LAYERS];

static U32 *LCD_Addr[] = {
  (U32 *)&Framebuffers[0]
#if GUI_NUM_LAYERS > 1
, (U32 *)&Framebuffers[1]
#endif
};

static int _aPendingBuffer[2] = { -1, -1 };
static int _aBufferIndex[GUI_NUM_LAYERS];
static int _axSize[GUI_NUM_LAYERS];
static int _aySize[GUI_NUM_LAYERS];
static int _aBytesPerPixels[GUI_NUM_LAYERS];
static U32 _aBuffer[XSIZE_PHYS * sizeof(U32) * 3];
static U32 * _pBuffer_DMA2D = &_aBuffer[XSIZE_PHYS * sizeof(U32) * 0];

void LCD_LL_DrawBitmap32bpp_filter(U8 const * p);

osSemaphoreId              LcdUpdateSemaphoreId = 0;
osSemaphoreId              osDma2dSemph = 0;
osMutexId                  osDeviceMutex = 0;

void DMA2D_IRQHandler(void);

/**
  * @}
  */

