STMicroelectronics/STM32CubeH7/Projects/STM32H750B-DK/Demonstrations/MenuLauncher/Gui/Target/LCDConf.c
  /* Load LUT using DMA2D */
  _DMA_LoadLUT((U32 *)pLogPal->pPalEntries, pLogPal->NumEntries);

  /* Return something not NULL */
  return _pBuffer_DMA2D;
}

/**
  * @brief  End of frame interrupt for managing multiple buffering
  * @param  hltdc: ltdc handle 
  * @retval None
  */
void HAL_LTDC_LineEvenCallback(LTDC_HandleTypeDef *hltdc) {
  U32 Addr;
  int i;

  for (i = 0; i < GUI_NUM_LAYERS; i++) 
  {
    if (_aPendingBuffer[i] >= 0) 
    {
      /* Calculate address of buffer to be used  as visible frame buffer */
      Addr = LCD_GetBufferAddress(i, _aPendingBuffer[i]);
      
      /* Store address into the LTDC regs */	  
      __HAL_LTDC_LAYER(hltdc, i)->CFBAR &= ~(LTDC_LxCFBAR_CFBADD);
      __HAL_LTDC_LAYER(hltdc, i)->CFBAR = Addr;
      __HAL_LTDC_RELOAD_IMMEDIATE_CONFIG(hltdc);
      
      /* Tell emWin that buffer is used */
      GUI_MULTIBUF_ConfirmEx(i, _aPendingBuffer[i]);
      
      /* Clear pending buffer flag of layer */
      _aPendingBuffer[i] = -1;
    }
  }
  HAL_LTDC_ProgramLineEvent(hltdc, 0);
  /* Release the semaphore to STemWin to draw next frame */
  osSemaphoreRelease( LcdUpdateSemaphoreId );
}

/**
  * @brief  Function is called by the display driver for several purposes
  * @param  LayerIndex: Index of layer to be configured
  * @param  Cmd       : Commands
  * @param  pData     : Pointer to a LCD_X_DATA structure
  * @retval int
  */
int LCD_X_DisplayDriver(unsigned LayerIndex, unsigned Cmd, void * pData)
{
  int r = 0;
  U32 addr;

  switch (Cmd)
  {
    case LCD_X_INITCONTROLLER:
    {
      /* Called during the initialization process in order to set up the display controller and put it into operation */
      break;
    }
    case LCD_X_SETORG:
    {
      /* Required for setting the display origin which is passed in the 'xPos' and 'yPos' element of p */
      LCD_X_SETORG_INFO * p;

      p = (LCD_X_SETORG_INFO *)pData;
      addr = LCD_GetBufferAddress(LayerIndex, 0) + p->yPos * _axSize[LayerIndex] * _aBytesPerPixels[LayerIndex];
      HAL_LTDC_SetAddress(&hltdc, addr, LayerIndex);
      break;
    }
    case LCD_X_SHOWBUFFER:
    {
      /* Required if multiple buffers are used. The 'Index' element of p contains the buffer index. */
      LCD_X_SHOWBUFFER_INFO * p;

      p = (LCD_X_SHOWBUFFER_INFO *)pData;

      /* Update the index of the buffer to use */
      LCD_Addr[LayerIndex] = (U32 *)LCD_GetBufferAddress(LayerIndex, p->Index);
      _aPendingBuffer[LayerIndex] = p->Index;

      LTDC_LAYER(&hltdc, LayerIndex)->CFBAR  = (U32 )LCD_Addr[LayerIndex];
      __HAL_LTDC_RELOAD_CONFIG(&hltdc);

      osSemaphoreWait( LcdUpdateSemaphoreId , osWaitForever );
      break;
    }
    case LCD_X_SETLUTENTRY:
    {
      /* Required for setting a lookup table entry which is passed in the 'Pos' and 'Color' element of p */
      LCD_X_SETLUTENTRY_INFO * p;

      p = (LCD_X_SETLUTENTRY_INFO *)pData;
      HAL_LTDC_ConfigCLUT(&hltdc, (uint32_t*)p->Color, p->Pos, LayerIndex);
      break;
    }
    case LCD_X_ON:
    {
      /* Required if the display controller should support switching on and off */
      BSP_LCD_Enable();
      __HAL_LTDC_ENABLE(&hltdc);
      break;
    }
    case LCD_X_OFF:
    {
      /* Required if the display controller should support switching on and off */
      __HAL_LTDC_DISABLE(&hltdc);
      break;
    }
    case LCD_X_SETVIS:
    {
      /* Required for setting the layer visibility which is passed in the 'OnOff' element of pData */
      LCD_X_SETVIS_INFO * p;

      p = (LCD_X_SETVIS_INFO *)pData;

      if(p->OnOff  == ENABLE )
      {
        __HAL_LTDC_LAYER_ENABLE(&hltdc, LayerIndex);
      }
      else
      {
        __HAL_LTDC_LAYER_DISABLE(&hltdc, LayerIndex);
      }
      __HAL_LTDC_RELOAD_CONFIG(&hltdc);

      break;
    }
    case LCD_X_SETPOS:
    {
      /* Required for setting the layer position which is passed in the 'xPos' and 'yPos' element of pData */
      LCD_X_SETPOS_INFO * p;

      p = (LCD_X_SETPOS_INFO *)pData;
      HAL_LTDC_SetWindowPosition(&hltdc, p->xPos, p->yPos, LayerIndex);
      break;
    }
    case LCD_X_SETSIZE:
    {
      /* Required for setting the layer position which is passed in the 'xPos' and 'yPos' element of pData */
      LCD_X_SETSIZE_INFO * p;
      int xPos, yPos;
      GUI_GetLayerPosEx(LayerIndex, &xPos, &yPos);
      p = (LCD_X_SETSIZE_INFO *)pData;
      if (LCD_GetSwapXYEx(LayerIndex))
      {
        _axSize[LayerIndex] = p->ySize;
        _aySize[LayerIndex] = p->xSize;
      }
      else
      {
        _axSize[LayerIndex] = p->xSize;
        _aySize[LayerIndex] = p->ySize;
      }
      HAL_LTDC_SetWindowPosition(&hltdc, xPos, yPos, LayerIndex);
      break;
    }
    case LCD_X_SETALPHA:
    {
      /* Required for setting the alpha value which is passed in the 'Alpha' element of pData */
      LCD_X_SETALPHA_INFO * p;

      p = (LCD_X_SETALPHA_INFO *)pData;
      HAL_LTDC_SetAlpha(&hltdc, p->Alpha, LayerIndex);
      break;
    }
    case LCD_X_SETCHROMAMODE:
    {
      /* Required for setting the chroma mode which is passed in the 'ChromaMode' element of pData */
      LCD_X_SETCHROMAMODE_INFO * p;

      p = (LCD_X_SETCHROMAMODE_INFO *)pData;
      if(p->ChromaMode != 0)
      {
        HAL_LTDC_EnableColorKeying(&hltdc, LayerIndex);
      }
      else
      {
        HAL_LTDC_DisableColorKeying(&hltdc, LayerIndex);
      }
      break;
    }
    case LCD_X_SETCHROMA:
    {
      /* Required for setting the chroma value which is passed in the 'ChromaMin' and 'ChromaMax' element of pData */
      LCD_X_SETCHROMA_INFO * p;
      U32 Color;

      p = (LCD_X_SETCHROMA_INFO *)pData;
      Color = ((p->ChromaMin & 0xFF0000) >> 16) | (p->ChromaMin & 0x00FF00) | ((p->ChromaMin & 0x0000FF) << 16);
      HAL_LTDC_ConfigColorKeying(&hltdc, Color, LayerIndex);
      break;
    }
    default:
      r = -1;
      break;
    }

    return r;
}

static void _ClearCacheHook(U32 LayerMask) {
 int i;
 for (i = 0; i < GUI_NUM_LAYERS; i++) {
  if (LayerMask & (1 << i))
  {
    if (_aBufferIndex[i] >= 0)
    {
      SCB_CleanDCache_by_Addr ((uint32_t *)LCD_GetBufferAddress(i, _aBufferIndex[i]), (_aySize[i] * _aySize[i] * _aBytesPerPixels[i]));
    }
  }
 }
}

/**
  * @brief  Called during the initialization process in order to set up the
  *         display driver configuration
  * @param  None
  * @retval None
  */
void LCD_X_Config(void)
{
  int i;
  U32 PixelFormat;

  GUI_DCACHE_SetClearCacheHook(_ClearCacheHook);

